www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205856.c
     (#) Some functions can be used any time to retrieve actual HRTIM status
             (++)HAL_HRTIM_GetState(): returns actual HRTIM instance HAL state.

     *** Callback registration ***
     =============================
     [..]
     The compilation flag USE_HAL_HRTIM_REGISTER_CALLBACKS when set to 1
     allows the user to configure dynamically the driver callbacks.
     Use Functions HAL_HRTIM_RegisterCallback() or
HAL_HRTIM_TIMxRegisterCallback() to register an interrupt callback.

     [..]
     Function HAL_HRTIM_RegisterCallback() allows to register following
callbacks:
       (+) Fault1Callback               : Fault 1 interrupt callback function
       (+) Fault2Callback               : Fault 2 interrupt callback function
       (+) Fault3Callback               : Fault 3 interrupt callback function
       (+) Fault4Callback               : Fault 4 interrupt callback function
       (+) Fault5Callback               : Fault 5 interrupt callback function
       (+) SystemFaultCallback          : System fault interrupt callback
function
       (+) DLLCalibrationReadyCallback  : DLL Ready interrupt callback function
       (+) BurstModePeriodCallback      : Burst mode period interrupt callback
function
       (+) SynchronizationEventCallback : Sync Input interrupt callback function
       (+) ErrorCallback                : DMA error callback function
       (+) MspInitCallback              : HRTIM MspInit callback function
       (+) MspDeInitCallback            : HRTIM MspInit callback function

     [..]
     Function HAL_HRTIM_TIMxRegisterCallback() allows to register following
callbacks:
       (+) RegistersUpdateCallback   : Timer x Update interrupt callback
function
       (+) RepetitionEventCallback   : Timer x Repetition interrupt callback
function
       (+) Compare1EventCallback     : Timer x Compare 1 match interrupt
callback function
       (+) Compare2EventCallback     : Timer x Compare 2 match interrupt
callback function
       (+) Compare3EventCallback     : Timer x Compare 3 match interrupt
callback function
       (+) Compare4EventCallback     : Timer x Compare 4 match interrupt
callback function
       (+) Capture1EventCallback     : Timer x Capture 1 interrupts callback
function
       (+) Capture2EventCallback     : Timer x Capture 2 interrupts callback
function
       (+) DelayedProtectionCallback : Timer x Delayed protection interrupt
callback function
       (+) CounterResetCallback      : Timer x counter reset/roll-over interrupt
callback function
       (+) Output1SetCallback        : Timer x output 1 set interrupt callback
function
       (+) Output1ResetCallback      : Timer x output 1 reset interrupt callback
function
       (+) Output2SetCallback        : Timer x output 2 set interrupt callback
function
       (+) Output2ResetCallback      : Timer x output 2 reset interrupt callback
function
       (+) BurstDMATransferCallback  : Timer x Burst DMA completed interrupt
callback function

     [..]
     Both functions take as parameters the HAL peripheral handle, the Callback
ID and a pointer to the user callback function.

     [..]
     Use function HAL_HRTIM_UnRegisterCallback or
HAL_HRTIM_TIMxUnRegisterCallback to reset a callback to the default weak
function. Both functions take  as parameters the HAL peripheral handle and the
Callback ID.

     [..]
     By default, after the HAL_HRTIM_Init() and when the state is
HAL_HRTIM_STATE_RESET all callbacks are set to the corresponding weak functions
(e.g HAL_HRTIM_Fault1Callback) Exception done for MspInit and MspDeInit
functions that are reset to the legacy weak functions in the HAL_HRTIM_Init()/
HAL_HRTIM_DeInit() only when these callbacks are null (not registered
beforehand). If MspInit or MspDeInit are not null, the HAL_HRTIM_Init()/
HAL_HRTIM_DeInit() keep and use the user MspInit/MspDeInit callbacks (registered
beforehand) whatever the state.

     [..]
     Callbacks can be registered/unregistered in HAL_HRTIM_STATE_READY state
only. Exception done MspInit/MspDeInit functions that can be
registered/unregistered in HAL_HRTIM_STATE_READY or HAL_HRTIM_STATE_RESET
states, thus registered (user) MspInit/DeInit callbacks can be used during the
Init/DeInit. Then, the user first registers the MspInit/MspDeInit user callbacks
     using HAL_HRTIM_RegisterCallback() before calling HAL_HRTIM_DeInit()
     or HAL_HRTIM_Init() function.

     [..]
     When the compilation flag USE_HAL_HRTIM_REGISTER_CALLBACKS is set to 0 or
     not defined, the callback registration feature is not available and all
     callbacks are set to the corresponding weak functions.

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/** @addtogroup STM32F3xx_HAL_Driver
 * @{
 */

#ifdef HAL_HRTIM_MODULE_ENABLED

#if defined(HRTIM1)

/** @defgroup HRTIM HRTIM
 * @brief HRTIM HAL module driver
 * @{
 */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup HRTIM_Private_Defines HRTIM Private Define
 * @{
 */
#define HRTIM_FLTR_FLTxEN                                                      \
  (HRTIM_FLTR_FLT1EN | HRTIM_FLTR_FLT2EN | HRTIM_FLTR_FLT3EN |                 \
   HRTIM_FLTR_FLT4EN | HRTIM_FLTR_FLT5EN)

#define HRTIM_TIMCR_TIMUPDATETRIGGER                                           \
  (HRTIM_TIMUPDATETRIGGER_MASTER | HRTIM_TIMUPDATETRIGGER_TIMER_A |            \
   HRTIM_TIMUPDATETRIGGER_TIMER_B | HRTIM_TIMUPDATETRIGGER_TIMER_C |           \
   HRTIM_TIMUPDATETRIGGER_TIMER_D | HRTIM_TIMUPDATETRIGGER_TIMER_E)

#define HRTIM_FLTINR1_FLTxLCK                                                  \
  ((HRTIM_FAULTLOCK_READONLY) | (HRTIM_FAULTLOCK_READONLY << 8U) |             \
   (HRTIM_FAULTLOCK_READONLY << 16U) | (HRTIM_FAULTLOCK_READONLY << 24U))

