www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205856.c
  /* Update the HRTIM registers except LOCK bit */
  hhrtim->Instance->sCommonRegs.FLTINR1 =
      (hrtim_fltinr1 & (~(HRTIM_FLTINR1_FLTxLCK)));
  hhrtim->Instance->sCommonRegs.FLTINR2 =
      (hrtim_fltinr2 & (~(HRTIM_FLTINR2_FLTxLCK)));

  /* Update the HRTIM registers LOCK bit */
  SET_BIT(hhrtim->Instance->sCommonRegs.FLTINR1,
          (hrtim_fltinr1 & HRTIM_FLTINR1_FLTxLCK));
  SET_BIT(hhrtim->Instance->sCommonRegs.FLTINR2,
          (hrtim_fltinr2 & HRTIM_FLTINR2_FLTxLCK));

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the fault conditioning block prescaler
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Prescaler Prescaler value
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_FAULTPRESCALER_DIV1: fFLTS=fHRTIM
 *                    @arg HRTIM_FAULTPRESCALER_DIV2: fFLTS=fHRTIM / 2
 *                    @arg HRTIM_FAULTPRESCALER_DIV4: fFLTS=fHRTIM / 4
 *                    @arg HRTIM_FAULTPRESCALER_DIV8: fFLTS=fHRTIM / 8
 * @retval HAL status
 * @note This function must be called before starting the timer and before
 *       enabling faults inputs
 */
HAL_StatusTypeDef HAL_HRTIM_FaultPrescalerConfig(HRTIM_HandleTypeDef *hhrtim,
                                                 uint32_t Prescaler) {
  /* Check parameters */
  assert_param(IS_HRTIM_FAULTPRESCALER(Prescaler));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Set the external event prescaler */
  MODIFY_REG(hhrtim->Instance->sCommonRegs.FLTINR2, HRTIM_FLTINR2_FLTSD,
             (Prescaler & HRTIM_FLTINR2_FLTSD));

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Enable or disables the HRTIMx Fault mode.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Faults fault input(s) to enable or disable
 *                   This parameter can be any combination of the following
 * values:
 *                    @arg HRTIM_FAULT_1: Fault input 1
 *                    @arg HRTIM_FAULT_2: Fault input 2
 *                    @arg HRTIM_FAULT_3: Fault input 3
 *                    @arg HRTIM_FAULT_4: Fault input 4
 *                    @arg HRTIM_FAULT_5: Fault input 5
 * @param  Enable Fault(s) enabling
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_FAULTMODECTL_ENABLED: Fault(s) enabled
 *                    @arg HRTIM_FAULTMODECTL_DISABLED: Fault(s) disabled
 * @retval None
 */
void HAL_HRTIM_FaultModeCtl(HRTIM_HandleTypeDef *hhrtim, uint32_t Faults,
                            uint32_t Enable) {
  /* Check parameters */
  assert_param(IS_HRTIM_FAULT(Faults));
  assert_param(IS_HRTIM_FAULTMODECTL(Enable));

  if ((Faults & HRTIM_FAULT_1) != (uint32_t)RESET) {
    MODIFY_REG(hhrtim->Instance->sCommonRegs.FLTINR1, HRTIM_FLTINR1_FLT1E,
               (Enable & HRTIM_FLTINR1_FLT1E));
  }
  if ((Faults & HRTIM_FAULT_2) != (uint32_t)RESET) {
    MODIFY_REG(hhrtim->Instance->sCommonRegs.FLTINR1, HRTIM_FLTINR1_FLT2E,
               ((Enable << 8U) & HRTIM_FLTINR1_FLT2E));
  }
  if ((Faults & HRTIM_FAULT_3) != (uint32_t)RESET) {
    MODIFY_REG(hhrtim->Instance->sCommonRegs.FLTINR1, HRTIM_FLTINR1_FLT3E,
               ((Enable << 16U) & HRTIM_FLTINR1_FLT3E));
  }
  if ((Faults & HRTIM_FAULT_4) != (uint32_t)RESET) {
    MODIFY_REG(hhrtim->Instance->sCommonRegs.FLTINR1, HRTIM_FLTINR1_FLT4E,
               ((Enable << 24U) & HRTIM_FLTINR1_FLT4E));
  }
  if ((Faults & HRTIM_FAULT_5) != (uint32_t)RESET) {
    MODIFY_REG(hhrtim->Instance->sCommonRegs.FLTINR2, HRTIM_FLTINR2_FLT5E,
               ((Enable)&HRTIM_FLTINR2_FLT5E));
  }
}

/**
 * @brief  Configure both the ADC trigger register update source and the ADC
 *         trigger source.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  ADCTrigger ADC trigger to configure
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_ADCTRIGGER_1: ADC trigger 1
 *                    @arg HRTIM_ADCTRIGGER_2: ADC trigger 2
 *                    @arg HRTIM_ADCTRIGGER_3: ADC trigger 3
 *                    @arg HRTIM_ADCTRIGGER_4: ADC trigger 4
 * @param  pADCTriggerCfg pointer to the ADC trigger configuration structure
 * @retval HAL status
 * @note This function must be called before starting the timer
 */
HAL_StatusTypeDef
HAL_HRTIM_ADCTriggerConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t ADCTrigger,
                           const HRTIM_ADCTriggerCfgTypeDef *pADCTriggerCfg) {
  uint32_t hrtim_cr1;

  /* Check parameters */
  assert_param(IS_HRTIM_ADCTRIGGER(ADCTrigger));
  assert_param(IS_HRTIM_ADCTRIGGERUPDATE(pADCTriggerCfg->UpdateSource));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Set the ADC trigger update source */
  hrtim_cr1 = hhrtim->Instance->sCommonRegs.CR1;

  switch (ADCTrigger) {
  case HRTIM_ADCTRIGGER_1: {
    hrtim_cr1 &= ~(HRTIM_CR1_ADC1USRC);
    hrtim_cr1 |= (pADCTriggerCfg->UpdateSource & HRTIM_CR1_ADC1USRC);

    /* Set the ADC trigger 1 source */
    hhrtim->Instance->sCommonRegs.ADC1R = pADCTriggerCfg->Trigger;
    break;
  }

  case HRTIM_ADCTRIGGER_2: {
    hrtim_cr1 &= ~(HRTIM_CR1_ADC2USRC);
    hrtim_cr1 |= ((pADCTriggerCfg->UpdateSource << 3U) & HRTIM_CR1_ADC2USRC);

    /* Set the ADC trigger 2 source */
    hhrtim->Instance->sCommonRegs.ADC2R = pADCTriggerCfg->Trigger;
    break;
  }

  case HRTIM_ADCTRIGGER_3: {
    hrtim_cr1 &= ~(HRTIM_CR1_ADC3USRC);
    hrtim_cr1 |= ((pADCTriggerCfg->UpdateSource << 6U) & HRTIM_CR1_ADC3USRC);

    /* Set the ADC trigger 3 source */
    hhrtim->Instance->sCommonRegs.ADC3R = pADCTriggerCfg->Trigger;
    break;
  }

  case HRTIM_ADCTRIGGER_4: {
    hrtim_cr1 &= ~(HRTIM_CR1_ADC4USRC);
    hrtim_cr1 |= ((pADCTriggerCfg->UpdateSource << 9U) & HRTIM_CR1_ADC4USRC);

