www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205856.c
    /* Set the ADC trigger 4 source */
    hhrtim->Instance->sCommonRegs.ADC4R = pADCTriggerCfg->Trigger;
    break;
  }

  default: {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    break;
  }
  }

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  }

  /* Update the HRTIM registers */
  hhrtim->Instance->sCommonRegs.CR1 = hrtim_cr1;

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @}
 */

/** @defgroup HRTIM_Exported_Functions_Group8 Timer waveform configuration and
functions
 *  @brief    HRTIM timer configuration and control functions
@verbatim
 ===============================================================================
              ##### HRTIM timer configuration and control functions #####
 ===============================================================================
    [..]  This section provides functions used to configure and control a
          HRTIM timer operating in waveform mode:
      (+) Configure HRTIM timer general behavior
      (+) Configure HRTIM timer event filtering
      (+) Configure HRTIM timer deadtime insertion
      (+) Configure HRTIM timer chopper mode
      (+) Configure HRTIM timer burst DMA
      (+) Configure HRTIM timer compare unit
      (+) Configure HRTIM timer capture unit
      (+) Configure HRTIM timer output
      (+) Set HRTIM timer output level
      (+) Enable HRTIM timer output
      (+) Disable HRTIM timer output
      (+) Start HRTIM timer
      (+) Stop HRTIM timer
      (+) Start HRTIM timer and enable interrupt
      (+) Stop HRTIM timer and disable interrupt
      (+) Start HRTIM timer and enable DMA transfer
      (+) Stop HRTIM timer and disable DMA transfer
      (+) Enable or disable the burst mode controller
      (+) Start the burst mode controller (by software)
      (+) Trigger a Capture (by software)
      (+) Update the HRTIM timer preloadable registers (by software)
      (+) Reset the HRTIM timer counter (by software)
      (+) Start a burst DMA transfer
      (+) Enable timer register update
      (+) Disable timer register update

@endverbatim
  * @{
  */

/**
 * @brief  Configure the general behavior of a timer operating in waveform mode
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_MASTER  for master timer
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  pTimerCfg pointer to the timer configuration structure
 * @note When the timer operates in waveform mode, all the features supported by
 *       the HRTIM are available without any limitation.
 * @retval HAL status
 * @note This function must be called before starting the timer
 */
HAL_StatusTypeDef
HAL_HRTIM_WaveformTimerConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
                              const HRTIM_TimerCfgTypeDef *pTimerCfg) {
  /* Check parameters */
  assert_param(IS_HRTIM_TIMERINDEX(TimerIdx));

  /* Relevant for all HRTIM timers, including the master */
  assert_param(IS_HRTIM_HALFMODE(pTimerCfg->HalfModeEnable));
  assert_param(IS_HRTIM_SYNCSTART(pTimerCfg->StartOnSync));
  assert_param(IS_HRTIM_SYNCRESET(pTimerCfg->ResetOnSync));
  assert_param(IS_HRTIM_DACSYNC(pTimerCfg->DACSynchro));
  assert_param(IS_HRTIM_PRELOAD(pTimerCfg->PreloadEnable));
  assert_param(IS_HRTIM_TIMERBURSTMODE(pTimerCfg->BurstMode));
  assert_param(IS_HRTIM_UPDATEONREPETITION(pTimerCfg->RepetitionUpdate));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  if (TimerIdx == HRTIM_TIMERINDEX_MASTER) {
    /* Check parameters */
    assert_param(IS_HRTIM_UPDATEGATING_MASTER(pTimerCfg->UpdateGating));
    assert_param(IS_HRTIM_MASTER_IT(pTimerCfg->InterruptRequests));
    assert_param(IS_HRTIM_MASTER_DMA(pTimerCfg->DMARequests));

    /* Configure master timer */
    HRTIM_MasterWaveform_Config(hhrtim, pTimerCfg);
  } else {
    /* Check parameters */
    assert_param(IS_HRTIM_UPDATEGATING_TIM(pTimerCfg->UpdateGating));
    assert_param(IS_HRTIM_TIM_IT(pTimerCfg->InterruptRequests));
    assert_param(IS_HRTIM_TIM_DMA(pTimerCfg->DMARequests));
    assert_param(IS_HRTIM_TIMPUSHPULLMODE(pTimerCfg->PushPull));
    assert_param(IS_HRTIM_TIMFAULTENABLE(pTimerCfg->FaultEnable));
    assert_param(IS_HRTIM_TIMFAULTLOCK(pTimerCfg->FaultLock));
    assert_param(IS_HRTIM_TIMDEADTIMEINSERTION(pTimerCfg->PushPull,
                                               pTimerCfg->DeadTimeInsertion));
    assert_param(IS_HRTIM_TIMDELAYEDPROTECTION(
        pTimerCfg->PushPull, pTimerCfg->DelayedProtectionMode));
    assert_param(IS_HRTIM_TIMUPDATETRIGGER(pTimerCfg->UpdateTrigger));
    assert_param(IS_HRTIM_TIMRESETTRIGGER(pTimerCfg->ResetTrigger));
    assert_param(IS_HRTIM_TIMUPDATEONRESET(pTimerCfg->ResetUpdate));

    /* Configure timing unit */
    HRTIM_TimingUnitWaveform_Config(hhrtim, TimerIdx, pTimerCfg);
  }

  /* Update timer parameters */
  hhrtim->TimerParam[TimerIdx].InterruptRequests = pTimerCfg->InterruptRequests;
  hhrtim->TimerParam[TimerIdx].DMARequests = pTimerCfg->DMARequests;
  hhrtim->TimerParam[TimerIdx].DMASrcAddress = pTimerCfg->DMASrcAddress;
  hhrtim->TimerParam[TimerIdx].DMADstAddress = pTimerCfg->DMADstAddress;
  hhrtim->TimerParam[TimerIdx].DMASize = pTimerCfg->DMASize;

  /* Force a software update */
  HRTIM_ForceRegistersUpdate(hhrtim, TimerIdx);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the event filtering capabilities of a timer (blanking,
 * windowing)
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  Event external event for which timer event filtering must be
 * configured This parameter can be one of the following values:
 *                    @arg HRTIM_EVENT_1: External event 1
 *                    @arg HRTIM_EVENT_2: External event 2
 *                    @arg HRTIM_EVENT_3: External event 3
 *                    @arg HRTIM_EVENT_4: External event 4
 *                    @arg HRTIM_EVENT_5: External event 5
 *                    @arg HRTIM_EVENT_6: External event 6
 *                    @arg HRTIM_EVENT_7: External event 7
 *                    @arg HRTIM_EVENT_8: External event 8
 *                    @arg HRTIM_EVENT_9: External event 9
 *                    @arg HRTIM_EVENT_10: External event 10
 * @param  pTimerEventFilteringCfg pointer to the timer event filtering
 * configuration structure
 * @note This function must be called before starting the timer
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_TimerEventFilteringConfig(
    HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx, uint32_t Event,
    const HRTIM_TimerEventFilteringCfgTypeDef *pTimerEventFilteringCfg) {
  /* Check parameters */
  assert_param(IS_HRTIM_TIMING_UNIT(TimerIdx));
  assert_param(IS_HRTIM_EVENT(Event));
  assert_param(IS_HRTIM_TIMEVENTFILTER(pTimerEventFilteringCfg->Filter));

  assert_param(IS_HRTIM_TIMEVENTLATCH(pTimerEventFilteringCfg->Latch));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Configure timer event filtering capabilities */
  switch (Event) {
  case HRTIM_EVENT_NONE: {
    CLEAR_REG(hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR1);
    CLEAR_REG(hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR2);
    break;
  }

  case HRTIM_EVENT_1: {
    MODIFY_REG(
        hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR1,
        (HRTIM_EEFR1_EE1FLTR | HRTIM_EEFR1_EE1LTCH),
        (pTimerEventFilteringCfg->Filter | pTimerEventFilteringCfg->Latch));
    break;
  }

  case HRTIM_EVENT_2: {
    MODIFY_REG(
        hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR1,
        (HRTIM_EEFR1_EE2FLTR | HRTIM_EEFR1_EE2LTCH),
        ((pTimerEventFilteringCfg->Filter | pTimerEventFilteringCfg->Latch)
         << 6U));
    break;
  }

  case HRTIM_EVENT_3: {
    MODIFY_REG(
        hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR1,
        (HRTIM_EEFR1_EE3FLTR | HRTIM_EEFR1_EE3LTCH),
        ((pTimerEventFilteringCfg->Filter | pTimerEventFilteringCfg->Latch)
         << 12U));
    break;
  }

  case HRTIM_EVENT_4: {
    MODIFY_REG(
        hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR1,
        (HRTIM_EEFR1_EE4FLTR | HRTIM_EEFR1_EE4LTCH),
        ((pTimerEventFilteringCfg->Filter | pTimerEventFilteringCfg->Latch)
         << 18U));
    break;
  }

  case HRTIM_EVENT_5: {
    MODIFY_REG(
        hhrtim->Instance->sTimerxRegs[TimerIdx].EEFxR1,
        (HRTIM_EEFR1_EE5FLTR | HRTIM_EEFR1_EE5LTCH),
        ((pTimerEventFilteringCfg->Filter | pTimerEventFilteringCfg->Latch)
         << 24U));
    break;
  }

