www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205856.c
  /* Set the burst DMA timer update register */
  switch (TimerIdx) {
  case HRTIM_TIMERINDEX_TIMER_A: {
    hhrtim->Instance->sCommonRegs.BDTAUPR = RegistersToUpdate;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_B: {
    hhrtim->Instance->sCommonRegs.BDTBUPR = RegistersToUpdate;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_C: {
    hhrtim->Instance->sCommonRegs.BDTCUPR = RegistersToUpdate;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_D: {
    hhrtim->Instance->sCommonRegs.BDTDUPR = RegistersToUpdate;
    break;
  }

  case HRTIM_TIMERINDEX_TIMER_E: {
    hhrtim->Instance->sCommonRegs.BDTEUPR = RegistersToUpdate;
    break;
  }

  case HRTIM_TIMERINDEX_MASTER: {
    hhrtim->Instance->sCommonRegs.BDMUPR = RegistersToUpdate;
    break;
  }

  default: {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    break;
  }
  }

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  }

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the compare unit of a timer operating in waveform mode
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_MASTER  for master timer
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  CompareUnit Compare unit to configure
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_COMPAREUNIT_1: Compare unit 1
 *                    @arg HRTIM_COMPAREUNIT_2: Compare unit 2
 *                    @arg HRTIM_COMPAREUNIT_3: Compare unit 3
 *                    @arg HRTIM_COMPAREUNIT_4: Compare unit 4
 * @param  pCompareCfg pointer to the compare unit configuration structure
 * @note When auto delayed mode is required for compare unit 2 or compare unit
 * 4, application has to configure separately the capture unit. Capture unit to
 * configure in that case depends on the compare unit auto delayed mode is
 * applied to (see below): Auto delayed on output compare 2: capture unit 1 must
 * be configured Auto delayed on output compare 4: capture unit 2 must be
 * configured
 * @retval HAL status
 * @note This function must be called before starting the timer
 */
HAL_StatusTypeDef
HAL_HRTIM_WaveformCompareConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
                                uint32_t CompareUnit,
                                const HRTIM_CompareCfgTypeDef *pCompareCfg) {
  /* Check parameters */
  assert_param(IS_HRTIM_TIMERINDEX(TimerIdx));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Configure the compare unit */
  if (TimerIdx == HRTIM_TIMERINDEX_MASTER) {
    switch (CompareUnit) {
    case HRTIM_COMPAREUNIT_1: {
      hhrtim->Instance->sMasterRegs.MCMP1R = pCompareCfg->CompareValue;
      break;
    }

    case HRTIM_COMPAREUNIT_2: {
      hhrtim->Instance->sMasterRegs.MCMP2R = pCompareCfg->CompareValue;
      break;
    }

    case HRTIM_COMPAREUNIT_3: {
      hhrtim->Instance->sMasterRegs.MCMP3R = pCompareCfg->CompareValue;
      break;
    }

    case HRTIM_COMPAREUNIT_4: {
      hhrtim->Instance->sMasterRegs.MCMP4R = pCompareCfg->CompareValue;
      break;
    }

    default: {
      hhrtim->State = HAL_HRTIM_STATE_ERROR;

      /* Process Unlocked */
      __HAL_UNLOCK(hhrtim);

      break;
    }
    }

    if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
      return HAL_ERROR;
    }

  } else {
    switch (CompareUnit) {
    case HRTIM_COMPAREUNIT_1: {
      /* Set the compare value */
      hhrtim->Instance->sTimerxRegs[TimerIdx].CMP1xR =
          pCompareCfg->CompareValue;
      break;
    }

    case HRTIM_COMPAREUNIT_2: {
      /* Check parameters */
      assert_param(IS_HRTIM_COMPAREUNIT_AUTODELAYEDMODE(
          CompareUnit, pCompareCfg->AutoDelayedMode));

      /* Set the compare value */
      hhrtim->Instance->sTimerxRegs[TimerIdx].CMP2xR =
          pCompareCfg->CompareValue;

      if (pCompareCfg->AutoDelayedMode != HRTIM_AUTODELAYEDMODE_REGULAR) {
        /* Configure auto-delayed mode */
        /* DELCMP2 bitfield must be reset when reprogrammed from one value */
        /* to the other to reinitialize properly the auto-delayed mechanism */
        hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxCR &= ~HRTIM_TIMCR_DELCMP2;
        hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxCR |=
            pCompareCfg->AutoDelayedMode;

        /* Set the compare value for timeout compare unit (if any) */
        if (pCompareCfg->AutoDelayedMode ==
            HRTIM_AUTODELAYEDMODE_AUTODELAYED_TIMEOUTCMP1) {
          hhrtim->Instance->sTimerxRegs[TimerIdx].CMP1xR =
              pCompareCfg->AutoDelayedTimeout;
        } else if (pCompareCfg->AutoDelayedMode ==
                   HRTIM_AUTODELAYEDMODE_AUTODELAYED_TIMEOUTCMP3) {
          hhrtim->Instance->sTimerxRegs[TimerIdx].CMP3xR =
              pCompareCfg->AutoDelayedTimeout;
        } else {
          /* nothing to do */
        }
      } else {
        /* Clear HRTIM_TIMxCR.DELCMP2 bitfield */
        MODIFY_REG(hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxCR,
                   HRTIM_TIMCR_DELCMP2, 0U);
      }
      break;
    }

    case HRTIM_COMPAREUNIT_3: {
      /* Set the compare value */
      hhrtim->Instance->sTimerxRegs[TimerIdx].CMP3xR =
          pCompareCfg->CompareValue;
      break;
    }

    case HRTIM_COMPAREUNIT_4: {
      /* Check parameters */
      assert_param(IS_HRTIM_COMPAREUNIT_AUTODELAYEDMODE(
          CompareUnit, pCompareCfg->AutoDelayedMode));

      /* Set the compare value */
      hhrtim->Instance->sTimerxRegs[TimerIdx].CMP4xR =
          pCompareCfg->CompareValue;

      if (pCompareCfg->AutoDelayedMode != HRTIM_AUTODELAYEDMODE_REGULAR) {
        /* Configure auto-delayed mode */
        /* DELCMP4 bitfield must be reset when reprogrammed from one value */
        /* to the other to reinitialize properly the auto-delayed mechanism */
        hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxCR &= ~HRTIM_TIMCR_DELCMP4;
        hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxCR |=
            (pCompareCfg->AutoDelayedMode << 2U);

        /* Set the compare value for timeout compare unit (if any) */
        if (pCompareCfg->AutoDelayedMode ==
            HRTIM_AUTODELAYEDMODE_AUTODELAYED_TIMEOUTCMP1) {
          hhrtim->Instance->sTimerxRegs[TimerIdx].CMP1xR =
              pCompareCfg->AutoDelayedTimeout;
        } else if (pCompareCfg->AutoDelayedMode ==
                   HRTIM_AUTODELAYEDMODE_AUTODELAYED_TIMEOUTCMP3) {
          hhrtim->Instance->sTimerxRegs[TimerIdx].CMP3xR =
              pCompareCfg->AutoDelayedTimeout;
        } else {
          /* nothing to do */
        }
      } else {
        /* Clear HRTIM_TIMxCR.DELCMP4 bitfield */
        MODIFY_REG(hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxCR,
                   HRTIM_TIMCR_DELCMP4, 0U);
      }
      break;
    }

    default: {
      hhrtim->State = HAL_HRTIM_STATE_ERROR;

      /* Process Unlocked */
      __HAL_UNLOCK(hhrtim);

      break;
    }
    }

    if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
      return HAL_ERROR;
    }
  }
  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the capture unit of a timer operating in waveform mode
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  CaptureUnit Capture unit to configure
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_CAPTUREUNIT_1: Capture unit 1
 *                    @arg HRTIM_CAPTUREUNIT_2: Capture unit 2
 * @param  pCaptureCfg pointer to the compare unit configuration structure
 * @retval HAL status
 * @note This function must be called before starting the timer
 */
HAL_StatusTypeDef
HAL_HRTIM_WaveformCaptureConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
                                uint32_t CaptureUnit,
                                const HRTIM_CaptureCfgTypeDef *pCaptureCfg) {
  /* Check parameters */
  assert_param(IS_HRTIM_TIMER_CAPTURETRIGGER(TimerIdx, pCaptureCfg->Trigger));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Configure the capture unit */
  switch (CaptureUnit) {
  case HRTIM_CAPTUREUNIT_1: {
    WRITE_REG(hhrtim->Instance->sTimerxRegs[TimerIdx].CPT1xCR,
              pCaptureCfg->Trigger);
    break;
  }

  case HRTIM_CAPTUREUNIT_2: {
    WRITE_REG(hhrtim->Instance->sTimerxRegs[TimerIdx].CPT2xCR,
              pCaptureCfg->Trigger);
    break;
  }

  default: {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    break;
  }
  }

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  }

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Configure the output of a timer operating in waveform mode
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  Output Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @param  pOutputCfg pointer to the timer output configuration structure
 * @retval HAL status
 * @note This function must be called before configuring the timer and after
 *       configuring the deadtime insertion feature (if required).
 */
HAL_StatusTypeDef
HAL_HRTIM_WaveformOutputConfig(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx,
                               uint32_t Output,
                               const HRTIM_OutputCfgTypeDef *pOutputCfg) {
  /* Check parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, Output));
  assert_param(IS_HRTIM_OUTPUTPOLARITY(pOutputCfg->Polarity));
  assert_param(IS_HRTIM_OUTPUTIDLELEVEL(pOutputCfg->IdleLevel));
  assert_param(IS_HRTIM_OUTPUTIDLEMODE(pOutputCfg->IdleMode));
  assert_param(IS_HRTIM_OUTPUTFAULTLEVEL(pOutputCfg->FaultLevel));
  assert_param(IS_HRTIM_OUTPUTCHOPPERMODE(pOutputCfg->ChopperModeEnable));
  assert_param(
      IS_HRTIM_OUTPUTBURSTMODEENTRY(pOutputCfg->BurstModeEntryDelayed));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Configure the timer output */
  HRTIM_OutputConfig(hhrtim, TimerIdx, Output, pOutputCfg);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Force the timer output to its active or inactive state
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  Output Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @param OutputLevel indicates whether the output is forced to its active or
 * inactive level This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUTLEVEL_ACTIVE: output is forced to its
 * active level
 *                    @arg HRTIM_OUTPUTLEVEL_INACTIVE: output is forced to its
 * inactive level
 * @retval HAL status
 * @note The 'software set/reset trigger' bit in the output set/reset registers
 *       is automatically reset by hardware
 */
HAL_StatusTypeDef HAL_HRTIM_WaveformSetOutputLevel(HRTIM_HandleTypeDef *hhrtim,
                                                   uint32_t TimerIdx,
                                                   uint32_t Output,
                                                   uint32_t OutputLevel) {
  /* Check parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, Output));
  assert_param(IS_HRTIM_OUTPUTLEVEL(OutputLevel));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Force timer output level */
  switch (Output) {
  case HRTIM_OUTPUT_TA1:
  case HRTIM_OUTPUT_TB1:
  case HRTIM_OUTPUT_TC1:
  case HRTIM_OUTPUT_TD1:
  case HRTIM_OUTPUT_TE1: {
    if (OutputLevel == HRTIM_OUTPUTLEVEL_ACTIVE) {
      /* Force output to its active state */
      SET_BIT(hhrtim->Instance->sTimerxRegs[TimerIdx].SETx1R, HRTIM_SET1R_SST);
    } else {
      /* Force output to its inactive state */
      SET_BIT(hhrtim->Instance->sTimerxRegs[TimerIdx].RSTx1R, HRTIM_RST1R_SRT);
    }
    break;
  }

  case HRTIM_OUTPUT_TA2:
  case HRTIM_OUTPUT_TB2:
  case HRTIM_OUTPUT_TC2:
  case HRTIM_OUTPUT_TD2:
  case HRTIM_OUTPUT_TE2: {
    if (OutputLevel == HRTIM_OUTPUTLEVEL_ACTIVE) {
      /* Force output to its active state */
      SET_BIT(hhrtim->Instance->sTimerxRegs[TimerIdx].SETx2R, HRTIM_SET2R_SST);
    } else {
      /* Force output to its inactive state */
      SET_BIT(hhrtim->Instance->sTimerxRegs[TimerIdx].RSTx2R, HRTIM_RST2R_SRT);
    }
    break;
  }

  default: {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    break;
  }
  }

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  }

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Enable the generation of the waveform signal on the designated
 * output(s) Outputs can be combined (ORed) to allow for simultaneous output
 * enabling.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  OutputsToStart Timer output(s) to enable
 *                    This parameter can be any combination of the following
 * values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_WaveformOutputStart(HRTIM_HandleTypeDef *hhrtim,
                                                uint32_t OutputsToStart) {
  /* Check the parameters */
  assert_param(IS_HRTIM_OUTPUT(OutputsToStart));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Enable the HRTIM outputs */
  hhrtim->Instance->sCommonRegs.OENR |= (OutputsToStart);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Disable the generation of the waveform signal on the designated
 * output(s) Outputs can be combined (ORed) to allow for simultaneous output
 * disabling.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  OutputsToStop Timer output(s) to disable
 *                    This parameter can be any combination of the following
 * values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_WaveformOutputStop(HRTIM_HandleTypeDef *hhrtim,
                                               uint32_t OutputsToStop) {
  /* Check the parameters */
  assert_param(IS_HRTIM_OUTPUT(OutputsToStop));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Enable the HRTIM outputs */
  hhrtim->Instance->sCommonRegs.ODISR |= (OutputsToStop);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Start the counter of the designated timer(s) operating in waveform
 * mode Timers can be combined (ORed) to allow for simultaneous counter start.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Timers Timer counter(s) to start
 *                   This parameter can be any combination of the following
 * values:
 *                   @arg HRTIM_TIMERID_MASTER
 *                   @arg HRTIM_TIMERID_TIMER_A
 *                   @arg HRTIM_TIMERID_TIMER_B
 *                   @arg HRTIM_TIMERID_TIMER_C
 *                   @arg HRTIM_TIMERID_TIMER_D
 *                   @arg HRTIM_TIMERID_TIMER_E
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_WaveformCountStart(HRTIM_HandleTypeDef *hhrtim,
                                               uint32_t Timers) {
  /* Check the parameters */
  assert_param(IS_HRTIM_TIMERID(Timers));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Enable timer(s) counter */
  hhrtim->Instance->sMasterRegs.MCR |= (Timers);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Stop the counter of the designated timer(s) operating in waveform
 * mode Timers can be combined (ORed) to allow for simultaneous counter stop.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Timers Timer counter(s) to stop
 *                   This parameter can be any combination of the following
 * values:
 *                   @arg HRTIM_TIMERID_MASTER
 *                   @arg HRTIM_TIMERID_TIMER_A
 *                   @arg HRTIM_TIMERID_TIMER_B
 *                   @arg HRTIM_TIMERID_TIMER_C
 *                   @arg HRTIM_TIMERID_TIMER_D
 *                   @arg HRTIM_TIMERID_TIMER_E
 * @retval HAL status
 * @note The counter of a timer is stopped only if all timer outputs are
 * disabled
 */
HAL_StatusTypeDef HAL_HRTIM_WaveformCountStop(HRTIM_HandleTypeDef *hhrtim,
                                              uint32_t Timers) {
  /* Check the parameters */
  assert_param(IS_HRTIM_TIMERID(Timers));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Disable timer(s) counter */
  hhrtim->Instance->sMasterRegs.MCR &= ~(Timers);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Start the counter of the designated timer(s) operating in waveform
 * mode Timers can be combined (ORed) to allow for simultaneous counter start.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Timers Timer counter(s) to start
 *                   This parameter can be any combination of the following
 * values:
 *                   @arg HRTIM_TIMERID_MASTER
 *                   @arg HRTIM_TIMERID_TIMER_A
 *                   @arg HRTIM_TIMERID_TIMER_B
 *                   @arg HRTIM_TIMERID_TIMER_C
 *                   @arg HRTIM_TIMERID_TIMER_D
 *                   @arg HRTIM_TIMERID_TIMER_E
 * @note HRTIM interrupts (e.g. faults interrupts) and interrupts related
 *       to the timers to start are enabled within this function.
 *       Interrupts to enable are selected through HAL_HRTIM_WaveformTimerConfig
 *       function.
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_WaveformCountStart_IT(HRTIM_HandleTypeDef *hhrtim,
                                                  uint32_t Timers) {
  uint8_t timer_idx;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMERID(Timers));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Enable HRTIM interrupts (if required) */
  __HAL_HRTIM_ENABLE_IT(hhrtim, hhrtim->Init.HRTIMInterruptResquests);

  /* Enable master timer related interrupts (if required) */
  if ((Timers & HRTIM_TIMERID_MASTER) != 0U) {
    __HAL_HRTIM_MASTER_ENABLE_IT(
        hhrtim, hhrtim->TimerParam[HRTIM_TIMERINDEX_MASTER].InterruptRequests);
  }

