www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205856.c
  /* Enable timing unit related interrupts (if required) */
  for (timer_idx = HRTIM_TIMERINDEX_TIMER_A;
       timer_idx < HRTIM_TIMERINDEX_MASTER; timer_idx++) {
    if ((Timers & TimerIdxToTimerId[timer_idx]) != 0U) {
      __HAL_HRTIM_TIMER_ENABLE_IT(
          hhrtim, timer_idx, hhrtim->TimerParam[timer_idx].InterruptRequests);
    }
  }

  /* Enable timer(s) counter */
  hhrtim->Instance->sMasterRegs.MCR |= (Timers);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Stop the counter of the designated timer(s) operating in waveform
 * mode Timers can be combined (ORed) to allow for simultaneous counter stop.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Timers Timer counter(s) to stop
 *                   This parameter can be any combination of the following
 * values:
 *                   @arg HRTIM_TIMERID_MASTER
 *                   @arg HRTIM_TIMERID_TIMER_A
 *                   @arg HRTIM_TIMERID_TIMER_B
 *                   @arg HRTIM_TIMERID_TIMER_C
 *                   @arg HRTIM_TIMERID_TIMER_D
 *                   @arg HRTIM_TIMERID_TIMER_E
 * @retval HAL status
 * @note The counter of a timer is stopped only if all timer outputs are
 * disabled
 * @note All enabled timer related interrupts are disabled.
 */
HAL_StatusTypeDef HAL_HRTIM_WaveformCountStop_IT(HRTIM_HandleTypeDef *hhrtim,
                                                 uint32_t Timers) {
  /* ++ WA */
  __IO uint32_t delai = (uint32_t)(0x17FU);
  /* -- WA */

  uint8_t timer_idx;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMERID(Timers));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Disable HRTIM interrupts (if required) */
  __HAL_HRTIM_DISABLE_IT(hhrtim, hhrtim->Init.HRTIMInterruptResquests);

  /* Disable master timer related interrupts (if required) */
  if ((Timers & HRTIM_TIMERID_MASTER) != 0U) {
    /* Interrupts enable flag must be cleared one by one */
    __HAL_HRTIM_MASTER_DISABLE_IT(
        hhrtim, hhrtim->TimerParam[HRTIM_TIMERINDEX_MASTER].InterruptRequests);
  }

  /* Disable timing unit related interrupts (if required) */
  for (timer_idx = HRTIM_TIMERINDEX_TIMER_A;
       timer_idx < HRTIM_TIMERINDEX_MASTER; timer_idx++) {
    if ((Timers & TimerIdxToTimerId[timer_idx]) != 0U) {
      __HAL_HRTIM_TIMER_DISABLE_IT(
          hhrtim, timer_idx, hhrtim->TimerParam[timer_idx].InterruptRequests);
    }
  }

  /* ++ WA */
  do {
    delai--;
  } while (delai != 0U);
  /* -- WA */

  /* Disable timer(s) counter */
  hhrtim->Instance->sMasterRegs.MCR &= ~(Timers);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Start the counter of the designated timer(s) operating in waveform
 * mode Timers can be combined (ORed) to allow for simultaneous counter start.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Timers Timer counter(s) to start
 *                   This parameter can be any combination of the following
 * values:
 *                   @arg HRTIM_TIMERID_MASTER
 *                   @arg HRTIM_TIMERID_TIMER_A
 *                   @arg HRTIM_TIMERID_TIMER_B
 *                   @arg HRTIM_TIMERID_TIMER_C
 *                   @arg HRTIM_TIMERID_TIMER_D
 *                   @arg HRTIM_TIMERID_TIMER_E
 * @retval HAL status
 * @note This function enables the dma request(s) mentioned in the timer
 *       configuration data structure for every timers to start.
 * @note The source memory address, the destination memory address and the
 *       size of each DMA transfer are specified at timer configuration time
 *       (see HAL_HRTIM_WaveformTimerConfig)
 */
HAL_StatusTypeDef HAL_HRTIM_WaveformCountStart_DMA(HRTIM_HandleTypeDef *hhrtim,
                                                   uint32_t Timers) {
  uint8_t timer_idx;
  DMA_HandleTypeDef *hdma;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMERID(Timers));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  if (((Timers & HRTIM_TIMERID_MASTER) != (uint32_t)RESET) &&
      (hhrtim->TimerParam[HRTIM_TIMERINDEX_MASTER].DMARequests != 0U)) {
    /* Set the DMA error callback */
    hhrtim->hdmaMaster->XferErrorCallback = HRTIM_DMAError;

    /* Set the DMA transfer completed callback */
    hhrtim->hdmaMaster->XferCpltCallback = HRTIM_DMAMasterCplt;

    /* Enable the DMA channel */
    if (HAL_DMA_Start_IT(
            hhrtim->hdmaMaster,
            hhrtim->TimerParam[HRTIM_TIMERINDEX_MASTER].DMASrcAddress,
            hhrtim->TimerParam[HRTIM_TIMERINDEX_MASTER].DMADstAddress,
            hhrtim->TimerParam[HRTIM_TIMERINDEX_MASTER].DMASize) != HAL_OK) {
      hhrtim->State = HAL_HRTIM_STATE_ERROR;

      /* Process Unlocked */
      __HAL_UNLOCK(hhrtim);

      return HAL_ERROR;
    }

    /* Enable the timer DMA request */
    __HAL_HRTIM_MASTER_ENABLE_DMA(
        hhrtim, hhrtim->TimerParam[HRTIM_TIMERINDEX_MASTER].DMARequests);
  }

  for (timer_idx = HRTIM_TIMERINDEX_TIMER_A;
       timer_idx < HRTIM_TIMERINDEX_MASTER; timer_idx++) {
    if (((Timers & TimerIdxToTimerId[timer_idx]) != (uint32_t)RESET) &&
        (hhrtim->TimerParam[timer_idx].DMARequests != 0U)) {
      /* Get the timer DMA handler */
      hdma = HRTIM_GetDMAHandleFromTimerIdx(hhrtim, timer_idx);

      if (hdma == NULL) {
        hhrtim->State = HAL_HRTIM_STATE_ERROR;

        /* Process Unlocked */
        __HAL_UNLOCK(hhrtim);

        return HAL_ERROR;
      }

      /* Set the DMA error callback */
      hdma->XferErrorCallback = HRTIM_DMAError;

      /* Set the DMA transfer completed callback */
      hdma->XferCpltCallback = HRTIM_DMATimerxCplt;

      /* Enable the DMA channel */
      if (HAL_DMA_Start_IT(hdma, hhrtim->TimerParam[timer_idx].DMASrcAddress,
                           hhrtim->TimerParam[timer_idx].DMADstAddress,
                           hhrtim->TimerParam[timer_idx].DMASize) != HAL_OK) {
        hhrtim->State = HAL_HRTIM_STATE_ERROR;

        /* Process Unlocked */
        __HAL_UNLOCK(hhrtim);

        return HAL_ERROR;
      }

