www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205856.c
  /* Force a software capture on concerned capture unit */
  switch (CaptureUnit) {
  case HRTIM_CAPTUREUNIT_1: {
    SET_BIT(hhrtim->Instance->sTimerxRegs[TimerIdx].CPT1xCR,
            HRTIM_CPT1CR_SWCPT);
    break;
  }

  case HRTIM_CAPTUREUNIT_2: {
    SET_BIT(hhrtim->Instance->sTimerxRegs[TimerIdx].CPT2xCR,
            HRTIM_CPT2CR_SWCPT);
    break;
  }

  default: {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    break;
  }
  }

  if (hhrtim->State == HAL_HRTIM_STATE_ERROR) {
    return HAL_ERROR;
  }

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Trig the update of the registers of one or several timers
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Timers timers concerned with the software register update
 *                   This parameter can be any combination of the following
 * values:
 *                   @arg HRTIM_TIMERUPDATE_MASTER
 *                   @arg HRTIM_TIMERUPDATE_A
 *                   @arg HRTIM_TIMERUPDATE_B
 *                   @arg HRTIM_TIMERUPDATE_C
 *                   @arg HRTIM_TIMERUPDATE_D
 *                   @arg HRTIM_TIMERUPDATE_E
 * @retval HAL status
 * @note The 'software update' bits in the HRTIM control register 2 register are
 *       automatically reset by hardware
 */
HAL_StatusTypeDef HAL_HRTIM_SoftwareUpdate(HRTIM_HandleTypeDef *hhrtim,
                                           uint32_t Timers) {
  /* Check parameters */
  assert_param(IS_HRTIM_TIMERUPDATE(Timers));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Force timer(s) registers update */
  hhrtim->Instance->sCommonRegs.CR2 |= Timers;

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Trig the reset of one or several timers
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Timers timers concerned with the software counter reset
 *                   This parameter can be any combination of the following
 * values:
 *                   @arg HRTIM_TIMERRESET_MASTER
 *                   @arg HRTIM_TIMERRESET_TIMER_A
 *                   @arg HRTIM_TIMERRESET_TIMER_B
 *                   @arg HRTIM_TIMERRESET_TIMER_C
 *                   @arg HRTIM_TIMERRESET_TIMER_D
 *                   @arg HRTIM_TIMERRESET_TIMER_E
 * @retval HAL status
 * @note The 'software reset' bits in the HRTIM control register 2  are
 *       automatically reset by hardware
 */
HAL_StatusTypeDef HAL_HRTIM_SoftwareReset(HRTIM_HandleTypeDef *hhrtim,
                                          uint32_t Timers) {
  /* Check parameters */
  assert_param(IS_HRTIM_TIMERRESET(Timers));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Force timer(s) registers reset */
  hhrtim->Instance->sCommonRegs.CR2 = Timers;

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Start a burst DMA operation to update HRTIM control registers content
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_MASTER  for master timer
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  BurstBufferAddress address of the buffer the HRTIM control registers
 *                             content will be updated from.
 * @param  BurstBufferLength size (in WORDS) of the burst buffer.
 * @retval HAL status
 * @note The TimerIdx parameter determines the dma channel to be used by the
 *       DMA burst controller (see below)
 *       HRTIM_TIMERINDEX_MASTER: DMA channel 2 is used by the DMA burst
 * controller HRTIM_TIMERINDEX_TIMER_A: DMA channel 3 is used by the DMA burst
 * controller HRTIM_TIMERINDEX_TIMER_B: DMA channel 4 is used by the DMA burst
 * controller HRTIM_TIMERINDEX_TIMER_C: DMA channel 5 is used by the DMA burst
 * controller HRTIM_TIMERINDEX_TIMER_D: DMA channel 6 is used by the DMA burst
 * controller HRTIM_TIMERINDEX_TIMER_E: DMA channel 7 is used by the DMA burst
 * controller
 */
HAL_StatusTypeDef HAL_HRTIM_BurstDMATransfer(HRTIM_HandleTypeDef *hhrtim,
                                             uint32_t TimerIdx,
                                             uint32_t BurstBufferAddress,
                                             uint32_t BurstBufferLength) {
  DMA_HandleTypeDef *hdma;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMERINDEX(TimerIdx));

  if (hhrtim->State == HAL_HRTIM_STATE_BUSY) {
    return HAL_BUSY;
  }
  if (hhrtim->State == HAL_HRTIM_STATE_READY) {
    if ((BurstBufferAddress == 0U) || (BurstBufferLength == 0U)) {
      return HAL_ERROR;
    } else {
      hhrtim->State = HAL_HRTIM_STATE_BUSY;
    }
  }

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  /* Get the timer DMA handler */
  hdma = HRTIM_GetDMAHandleFromTimerIdx(hhrtim, TimerIdx);

  if (hdma == NULL) {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    return HAL_ERROR;
  }

  /* Set the DMA transfer completed callback */
  hdma->XferCpltCallback = HRTIM_BurstDMACplt;

  /* Set the DMA error callback */
  hdma->XferErrorCallback = HRTIM_DMAError;

  /* Enable the DMA channel */
  if (HAL_DMA_Start_IT(hdma, BurstBufferAddress,
                       (uint32_t)&(hhrtim->Instance->sCommonRegs.BDMADR),
                       BurstBufferLength) != HAL_OK) {
    hhrtim->State = HAL_HRTIM_STATE_ERROR;

    /* Process Unlocked */
    __HAL_UNLOCK(hhrtim);

    return HAL_ERROR;
  }

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Enable the transfer from preload to active registers for one
 *         or several timing units (including master timer).
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Timers Timer(s) concerned by the register preload enabling command
 *                   This parameter can be any combination of the following
 * values:
 *                   @arg HRTIM_TIMERUPDATE_MASTER
 *                   @arg HRTIM_TIMERUPDATE_A
 *                   @arg HRTIM_TIMERUPDATE_B
 *                   @arg HRTIM_TIMERUPDATE_C
 *                   @arg HRTIM_TIMERUPDATE_D
 *                   @arg HRTIM_TIMERUPDATE_E
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_UpdateEnable(HRTIM_HandleTypeDef *hhrtim,
                                         uint32_t Timers) {
  /* Check the parameters */
  assert_param(IS_HRTIM_TIMERUPDATE(Timers));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Enable timer(s) registers update */
  hhrtim->Instance->sCommonRegs.CR1 &= ~(Timers);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @brief  Disable the transfer from preload to active registers for one
 *         or several timing units (including master timer).
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  Timers Timer(s) concerned by the register preload disabling command
 *                   This parameter can be any combination of the following
 * values:
 *                   @arg HRTIM_TIMERUPDATE_MASTER
 *                   @arg HRTIM_TIMERUPDATE_A
 *                   @arg HRTIM_TIMERUPDATE_B
 *                   @arg HRTIM_TIMERUPDATE_C
 *                   @arg HRTIM_TIMERUPDATE_D
 *                   @arg HRTIM_TIMERUPDATE_E
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_HRTIM_UpdateDisable(HRTIM_HandleTypeDef *hhrtim,
                                          uint32_t Timers) {
  /* Check the parameters */
  assert_param(IS_HRTIM_TIMERUPDATE(Timers));

  /* Process Locked */
  __HAL_LOCK(hhrtim);

  hhrtim->State = HAL_HRTIM_STATE_BUSY;

  /* Enable timer(s) registers update */
  hhrtim->Instance->sCommonRegs.CR1 |= (Timers);

  hhrtim->State = HAL_HRTIM_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hhrtim);

  return HAL_OK;
}

/**
 * @}
 */

/** @defgroup HRTIM_Exported_Functions_Group9 Peripheral state functions
 *  @brief    Peripheral State functions
@verbatim
 ===============================================================================
              ##### Peripheral State functions #####
 ===============================================================================
    [..]  This section provides functions used to get HRTIM or HRTIM timer
          specific information:
      (+) Get HRTIM HAL state
      (+) Get captured value
      (+) Get HRTIM timer output level
      (+) Get HRTIM timer output state
      (+) Get delayed protection status
      (+) Get burst status
      (+) Get current push-pull status
      (+) Get idle push-pull status

@endverbatim
  * @{
  */

/**
 * @brief  Return the HRTIM HAL state
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval HAL state
 */
HAL_HRTIM_StateTypeDef HAL_HRTIM_GetState(const HRTIM_HandleTypeDef *hhrtim) {
  /* Return HRTIM state */
  return hhrtim->State;
}

/**
 * @brief  Return actual value of the capture register of the designated capture
 * unit
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  CaptureUnit Capture unit to trig
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_CAPTUREUNIT_1: Capture unit 1
 *                    @arg HRTIM_CAPTUREUNIT_2: Capture unit 2
 * @retval Captured value
 */
uint32_t HAL_HRTIM_GetCapturedValue(const HRTIM_HandleTypeDef *hhrtim,
                                    uint32_t TimerIdx, uint32_t CaptureUnit) {
  uint32_t captured_value;

  /* Check parameters */
  assert_param(IS_HRTIM_TIMING_UNIT(TimerIdx));
  assert_param(IS_HRTIM_CAPTUREUNIT(CaptureUnit));

  /* Read captured value */
  switch (CaptureUnit) {
  case HRTIM_CAPTUREUNIT_1: {
    captured_value = hhrtim->Instance->sTimerxRegs[TimerIdx].CPT1xR;
    break;
  }

  case HRTIM_CAPTUREUNIT_2: {
    captured_value = hhrtim->Instance->sTimerxRegs[TimerIdx].CPT2xR;
    break;
  }

  default: {
    captured_value = 0xFFFFFFFFUL;
    break;
  }
  }

  return captured_value;
}

/**
 * @brief  Return actual level (active or inactive) of the designated output
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  Output Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @retval Output level
 * @note Returned output level is taken before the output stage (chopper,
 *        polarity).
 */
uint32_t HAL_HRTIM_WaveformGetOutputLevel(const HRTIM_HandleTypeDef *hhrtim,
                                          uint32_t TimerIdx, uint32_t Output) {
  uint32_t output_level;

  /* Check parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, Output));

