www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205856.c
  /* Read the output level */
  switch (Output) {
  case HRTIM_OUTPUT_TA1:
  case HRTIM_OUTPUT_TB1:
  case HRTIM_OUTPUT_TC1:
  case HRTIM_OUTPUT_TD1:
  case HRTIM_OUTPUT_TE1: {
    if ((hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxISR &
         HRTIM_TIMISR_O1CPY) != (uint32_t)RESET) {
      output_level = HRTIM_OUTPUTLEVEL_ACTIVE;
    } else {
      output_level = HRTIM_OUTPUTLEVEL_INACTIVE;
    }
    break;
  }

  case HRTIM_OUTPUT_TA2:
  case HRTIM_OUTPUT_TB2:
  case HRTIM_OUTPUT_TC2:
  case HRTIM_OUTPUT_TD2:
  case HRTIM_OUTPUT_TE2: {
    if ((hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxISR &
         HRTIM_TIMISR_O2CPY) != (uint32_t)RESET) {
      output_level = HRTIM_OUTPUTLEVEL_ACTIVE;
    } else {
      output_level = HRTIM_OUTPUTLEVEL_INACTIVE;
    }
    break;
  }

  default: {
    output_level = 0xFFFFFFFFUL;
    break;
  }
  }

  return output_level;
}

/**
 * @brief  Return actual state (RUN, IDLE, FAULT) of the designated output
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  Output Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @retval Output state
 */
uint32_t HAL_HRTIM_WaveformGetOutputState(const HRTIM_HandleTypeDef *hhrtim,
                                          uint32_t TimerIdx, uint32_t Output) {
  uint32_t output_bit;
  uint32_t output_state;

  /* Check parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, Output));

  /* Prevent unused argument(s) compilation warning */
  UNUSED(TimerIdx);

  /* Set output state according to output control status and output disable
   * status */
  switch (Output) {
  case HRTIM_OUTPUT_TA1: {
    output_bit = HRTIM_OENR_TA1OEN;
    break;
  }

  case HRTIM_OUTPUT_TA2: {
    output_bit = HRTIM_OENR_TA2OEN;
    break;
  }

  case HRTIM_OUTPUT_TB1: {
    output_bit = HRTIM_OENR_TB1OEN;
    break;
  }

  case HRTIM_OUTPUT_TB2: {
    output_bit = HRTIM_OENR_TB2OEN;
    break;
  }

  case HRTIM_OUTPUT_TC1: {
    output_bit = HRTIM_OENR_TC1OEN;
    break;
  }

  case HRTIM_OUTPUT_TC2: {
    output_bit = HRTIM_OENR_TC2OEN;
    break;
  }

  case HRTIM_OUTPUT_TD1: {
    output_bit = HRTIM_OENR_TD1OEN;
    break;
  }

  case HRTIM_OUTPUT_TD2: {
    output_bit = HRTIM_OENR_TD2OEN;
    break;
  }

  case HRTIM_OUTPUT_TE1: {
    output_bit = HRTIM_OENR_TE1OEN;
    break;
  }

  case HRTIM_OUTPUT_TE2: {
    output_bit = HRTIM_OENR_TE2OEN;
    break;
  }

  default: {
    output_bit = 0UL;
    break;
  }
  }

  if ((hhrtim->Instance->sCommonRegs.OENR & output_bit) != (uint32_t)RESET) {
    /* Output is enabled: output in RUN state (whatever output disable status
     * is)*/
    output_state = HRTIM_OUTPUTSTATE_RUN;
  } else {
    if ((hhrtim->Instance->sCommonRegs.ODSR & output_bit) != (uint32_t)RESET) {
      /* Output is disabled: output in FAULT state */
      output_state = HRTIM_OUTPUTSTATE_FAULT;
    } else {
      /* Output is disabled: output in IDLE state */
      output_state = HRTIM_OUTPUTSTATE_IDLE;
    }
  }

  return (output_state);
}

/**
 * @brief  Return the level (active or inactive) of the designated output
 *         when the delayed protection was triggered.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @param  Output Timer output
 *                    This parameter can be one of the following values:
 *                    @arg HRTIM_OUTPUT_TA1: Timer A - Output 1
 *                    @arg HRTIM_OUTPUT_TA2: Timer A - Output 2
 *                    @arg HRTIM_OUTPUT_TB1: Timer B - Output 1
 *                    @arg HRTIM_OUTPUT_TB2: Timer B - Output 2
 *                    @arg HRTIM_OUTPUT_TC1: Timer C - Output 1
 *                    @arg HRTIM_OUTPUT_TC2: Timer C - Output 2
 *                    @arg HRTIM_OUTPUT_TD1: Timer D - Output 1
 *                    @arg HRTIM_OUTPUT_TD2: Timer D - Output 2
 *                    @arg HRTIM_OUTPUT_TE1: Timer E - Output 1
 *                    @arg HRTIM_OUTPUT_TE2: Timer E - Output 2
 * @retval Delayed protection status
 */
uint32_t HAL_HRTIM_GetDelayedProtectionStatus(const HRTIM_HandleTypeDef *hhrtim,
                                              uint32_t TimerIdx,
                                              uint32_t Output) {
  uint32_t delayed_protection_status;

  /* Check parameters */
  assert_param(IS_HRTIM_TIMER_OUTPUT(TimerIdx, Output));

  /* Read the delayed protection status */
  switch (Output) {
  case HRTIM_OUTPUT_TA1:
  case HRTIM_OUTPUT_TB1:
  case HRTIM_OUTPUT_TC1:
  case HRTIM_OUTPUT_TD1:
  case HRTIM_OUTPUT_TE1: {
    if ((hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxISR &
         HRTIM_TIMISR_O1STAT) != (uint32_t)RESET) {
      /* Output 1 was active when the delayed idle protection was triggered */
      delayed_protection_status = HRTIM_OUTPUTLEVEL_ACTIVE;
    } else {
      /* Output 1 was inactive when the delayed idle protection was triggered */
      delayed_protection_status = HRTIM_OUTPUTLEVEL_INACTIVE;
    }
    break;
  }

  case HRTIM_OUTPUT_TA2:
  case HRTIM_OUTPUT_TB2:
  case HRTIM_OUTPUT_TC2:
  case HRTIM_OUTPUT_TD2:
  case HRTIM_OUTPUT_TE2: {
    if ((hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxISR &
         HRTIM_TIMISR_O2STAT) != (uint32_t)RESET) {
      /* Output 2 was active when the delayed idle protection was triggered */
      delayed_protection_status = HRTIM_OUTPUTLEVEL_ACTIVE;
    } else {
      /* Output 2 was inactive when the delayed idle protection was triggered */
      delayed_protection_status = HRTIM_OUTPUTLEVEL_INACTIVE;
    }
    break;
  }

  default: {
    delayed_protection_status = 0xFFFFFFFFUL;
    break;
  }
  }

  return delayed_protection_status;
}

/**
 * @brief  Return the actual status (active or inactive) of the burst mode
 * controller
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval Burst mode controller status
 */
uint32_t HAL_HRTIM_GetBurstStatus(const HRTIM_HandleTypeDef *hhrtim) {
  uint32_t burst_mode_status;

  /* Read burst mode status */
  burst_mode_status = (hhrtim->Instance->sCommonRegs.BMCR & HRTIM_BMCR_BMSTAT);

  return burst_mode_status;
}

/**
 * @brief  Indicate on which output the signal is currently active (when the
 *         push pull mode is enabled).
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @retval Burst mode controller status
 */
uint32_t HAL_HRTIM_GetCurrentPushPullStatus(const HRTIM_HandleTypeDef *hhrtim,
                                            uint32_t TimerIdx) {
  uint32_t current_pushpull_status;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMING_UNIT(TimerIdx));

  /* Read current push pull status */
  current_pushpull_status =
      (hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxISR & HRTIM_TIMISR_CPPSTAT);

  return current_pushpull_status;
}

/**
  * @brief  Indicate on which output the signal was applied, in push-pull mode,
            balanced fault mode or delayed idle mode, when the protection was
  triggered.
  * @param  hhrtim pointer to HAL HRTIM handle
  * @param  TimerIdx Timer index
  *                   This parameter can be one of the following values:
  *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
  *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
  *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
  *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
  *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
  * @retval Idle Push Pull Status
  */
uint32_t HAL_HRTIM_GetIdlePushPullStatus(const HRTIM_HandleTypeDef *hhrtim,
                                         uint32_t TimerIdx) {
  uint32_t idle_pushpull_status;

  /* Check the parameters */
  assert_param(IS_HRTIM_TIMING_UNIT(TimerIdx));

  /* Read current push pull status */
  idle_pushpull_status =
      (hhrtim->Instance->sTimerxRegs[TimerIdx].TIMxISR & HRTIM_TIMISR_IPPSTAT);

  return idle_pushpull_status;
}

/**
 * @}
 */

/** @defgroup HRTIM_Exported_Functions_Group10 Interrupts handling
 *  @brief  Functions called when HRTIM generates an interrupt
 *          7 interrupts can be generated by the master timer:
 *            - Master timer registers update
 *            - Synchronization event received
 *            - Master timer repetition event
 *            - Master Compare 1 to 4 event
 *          14 interrupts can be generated by each timing unit:
 *            - Delayed protection triggered
 *            - Counter reset or roll-over event
 *            - Output 1 and output 2 reset (transition active to inactive)
 *            - Output 1 and output 2 set (transition inactive to active)
 *            - Capture 1 and 2 events
 *            - Timing unit registers update
 *            - Repetition event
 *            - Compare 1 to 4 event
 *          8 global interrupts are generated for the whole HRTIM:
 *            - System fault and Fault 1 to 5 (regardless of the timing unit
attribution)
 *            - DLL calibration done
 *            - Burst mode period completed
@verbatim
 ===============================================================================
                      ##### HRTIM interrupts handling #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the HRTIM
    interrupts:
      (+)  HRTIM interrupt handler
      (+)  Callback function called when Fault1 interrupt occurs
      (+)  Callback function called when Fault2 interrupt occurs
      (+)  Callback function called when Fault3 interrupt occurs
      (+)  Callback function called when Fault4 interrupt occurs
      (+)  Callback function called when Fault5 interrupt occurs
      (+)  Callback function called when system Fault interrupt occurs
      (+)  Callback function called when DLL ready interrupt occurs
      (+)  Callback function called when burst mode period interrupt occurs
      (+)  Callback function called when synchronization input interrupt occurs
      (+)  Callback function called when a timer register update interrupt
occurs
      (+)  Callback function called when a timer repetition interrupt occurs
      (+)  Callback function called when a compare 1 match interrupt occurs
      (+)  Callback function called when a compare 2 match interrupt occurs
      (+)  Callback function called when a compare 3 match interrupt occurs
      (+)  Callback function called when a compare 4 match interrupt occurs
      (+)  Callback function called when a capture 1 interrupt occurs
      (+)  Callback function called when a capture 2 interrupt occurs
      (+)  Callback function called when a delayed protection interrupt occurs
      (+)  Callback function called when a timer counter reset interrupt occurs
      (+)  Callback function called when a timer output 1 set interrupt occurs
      (+)  Callback function called when a timer output 1 reset interrupt occurs
      (+)  Callback function called when a timer output 2 set interrupt occurs
      (+)  Callback function called when a timer output 2 reset interrupt occurs
      (+)  Callback function called when a timer output 2 reset interrupt occurs
      (+)  Callback function called upon completion of a burst DMA transfer
      (+)  HRTIM callback function registration
      (+)  HRTIM callback function unregistration
      (+)  HRTIM Timer x callback function registration
      (+)  HRTIM Timer x callback function unregistration

@endverbatim
  * @{
  */

/**
 * @brief  This function handles HRTIM interrupt request.
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be any value of HRTIM_Timer_Index
 * @retval None
 */
void HAL_HRTIM_IRQHandler(HRTIM_HandleTypeDef *hhrtim, uint32_t TimerIdx) {
  /* HRTIM interrupts handling */
  if (TimerIdx == HRTIM_TIMERINDEX_COMMON) {
    HRTIM_HRTIM_ISR(hhrtim);
  } else if (TimerIdx == HRTIM_TIMERINDEX_MASTER) {
    /* Master related interrupts handling */
    HRTIM_Master_ISR(hhrtim);
  } else {
    /* Timing unit related interrupts handling */
    HRTIM_Timer_ISR(hhrtim, TimerIdx);
  }
}

/**
 * @brief  Callback function invoked when a fault 1 interrupt occurred
 * @param  hhrtim pointer to HAL HRTIM handle  * @retval None
 * @retval None
 */
__weak void HAL_HRTIM_Fault1Callback(HRTIM_HandleTypeDef *hhrtim) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_Fault1Callback could be implemented in the user file
   */
}

/**
 * @brief  Callback function invoked when a fault 2 interrupt occurred
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 */
__weak void HAL_HRTIM_Fault2Callback(HRTIM_HandleTypeDef *hhrtim) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_Fault2Callback could be implemented in the user file
   */
}

/**
 * @brief  Callback function invoked when a fault 3 interrupt occurred
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 */
__weak void HAL_HRTIM_Fault3Callback(HRTIM_HandleTypeDef *hhrtim) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_Fault3Callback could be implemented in the user file
   */
}

/**
 * @brief  Callback function invoked when a fault 4 interrupt occurred
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 */
__weak void HAL_HRTIM_Fault4Callback(HRTIM_HandleTypeDef *hhrtim) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_Fault4Callback could be implemented in the user file
   */
}

/**
 * @brief  Callback function invoked when a fault 5 interrupt occurred
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 */
__weak void HAL_HRTIM_Fault5Callback(HRTIM_HandleTypeDef *hhrtim) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_Fault5Callback could be implemented in the user file
   */
}

/**
 * @brief  Callback function invoked when a system fault interrupt occurred
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 */
__weak void HAL_HRTIM_SystemFaultCallback(HRTIM_HandleTypeDef *hhrtim) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_SystemFaultCallback could be implemented in the user
     file
   */
}

/**
 * @brief  Callback function invoked when the DLL calibration is completed
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 */
__weak void HAL_HRTIM_DLLCalibrationReadyCallback(HRTIM_HandleTypeDef *hhrtim) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_DLLCalibrationCallback could be implemented in the
     user file
   */
}

/**
 * @brief  Callback function invoked when the end of the burst mode period is
 * reached
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 */
__weak void HAL_HRTIM_BurstModePeriodCallback(HRTIM_HandleTypeDef *hhrtim) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_BurstModeCallback could be implemented in the user
     file
   */
}

/**
 * @brief  Callback function invoked when a synchronization input event is
 * received
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 */
__weak void
HAL_HRTIM_SynchronizationEventCallback(HRTIM_HandleTypeDef *hhrtim) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_SynchronizationEventCallback could be implemented in
     the user file
   */
}

/**
 * @brief  Callback function invoked when timer registers are updated
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_MASTER  for master timer
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @retval None
 */
__weak void HAL_HRTIM_RegistersUpdateCallback(HRTIM_HandleTypeDef *hhrtim,
                                              uint32_t TimerIdx) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);
  UNUSED(TimerIdx);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_Master_RegistersUpdateCallback could be implemented in
     the user file
   */
}

/**
 * @brief  Callback function invoked when timer repetition period has elapsed
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_MASTER  for master timer
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @retval None
 */
__weak void HAL_HRTIM_RepetitionEventCallback(HRTIM_HandleTypeDef *hhrtim,
                                              uint32_t TimerIdx) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);
  UNUSED(TimerIdx);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_Master_RepetitionEventCallback could be implemented in
     the user file
   */
}

/**
 * @brief  Callback function invoked when the timer counter matches the value
 *         programmed in the compare 1 register
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_MASTER  for master timer
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @retval None
 */
__weak void HAL_HRTIM_Compare1EventCallback(HRTIM_HandleTypeDef *hhrtim,
                                            uint32_t TimerIdx) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);
  UNUSED(TimerIdx);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_Master_Compare1EventCallback could be implemented in
     the user file
   */
}

/**
 * @brief  Callback function invoked when the timer counter matches the value
 *         programmed in the compare 2 register
 * @param  hhrtim pointer to HAL HRTIM handle
 * @retval None
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_MASTER  for master timer
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 */
__weak void HAL_HRTIM_Compare2EventCallback(HRTIM_HandleTypeDef *hhrtim,
                                            uint32_t TimerIdx) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);
  UNUSED(TimerIdx);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_HRTIM_Master_Compare2EventCallback could be implemented in
     the user file
   */
}

/**
 * @brief  Callback function invoked when the timer counter matches the value
 *         programmed in the compare 3 register
 * @param  hhrtim pointer to HAL HRTIM handle
 * @param  TimerIdx Timer index
 *                   This parameter can be one of the following values:
 *                   @arg HRTIM_TIMERINDEX_MASTER  for master timer
 *                   @arg HRTIM_TIMERINDEX_TIMER_A for timer A
 *                   @arg HRTIM_TIMERINDEX_TIMER_B for timer B
 *                   @arg HRTIM_TIMERINDEX_TIMER_C for timer C
 *                   @arg HRTIM_TIMERINDEX_TIMER_D for timer D
 *                   @arg HRTIM_TIMERINDEX_TIMER_E for timer E
 * @retval None
 */
__weak void HAL_HRTIM_Compare3EventCallback(HRTIM_HandleTypeDef *hhrtim,
                                            uint32_t TimerIdx) {
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhrtim);
  UNUSED(TimerIdx);

