www666www6661/SuperCap/.history/Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim_20251025205856.c
  HRTIM_HandleTypeDef *hrtim =
      (HRTIM_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  timer_idx = (uint8_t)GetTimerIdxFromDMAHandle(hrtim, hdma);

  if (!IS_HRTIM_TIMING_UNIT(timer_idx)) {
    return;
  }

  if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER & HRTIM_TIM_DMA_CMP1) !=
      (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->Compare1EventCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_Compare1EventCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_CMP2) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->Compare2EventCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_Compare2EventCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_CMP3) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->Compare3EventCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_Compare3EventCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_CMP4) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->Compare4EventCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_Compare4EventCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_UPD) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->RegistersUpdateCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_RegistersUpdateCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_CPT1) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->Capture1EventCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_Capture1EventCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_CPT2) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->Capture2EventCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_Capture2EventCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_SET1) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->Output1SetCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_Output1SetCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_RST1) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->Output1ResetCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_Output1ResetCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_SET2) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->Output2SetCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_Output2SetCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_RST2) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->Output2ResetCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_Output2ResetCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_RST) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->CounterResetCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_CounterResetCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_DLYPRT) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->DelayedProtectionCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_DelayedProtectionCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else if ((hrtim->Instance->sTimerxRegs[timer_idx].TIMxDIER &
              HRTIM_TIM_DMA_REP) != (uint32_t)RESET) {
#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
    hrtim->RepetitionEventCallback(hrtim, timer_idx);
#else
    HAL_HRTIM_RepetitionEventCallback(hrtim, timer_idx);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
  } else {
    /* nothing to do */
  }
}

/**
 * @brief  DMA error callback
 * @param  hdma pointer to DMA handle.
 * @retval None
 */
static void HRTIM_DMAError(DMA_HandleTypeDef *hdma) {
  HRTIM_HandleTypeDef *hrtim =
      (HRTIM_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
  hrtim->ErrorCallback(hrtim);
#else
  HAL_HRTIM_ErrorCallback(hrtim);
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
}

/**
 * @brief  DMA callback invoked upon burst DMA transfer completion
 * @param  hdma pointer to DMA handle.
 * @retval None
 */
static void HRTIM_BurstDMACplt(DMA_HandleTypeDef *hdma) {
  HRTIM_HandleTypeDef *hrtim =
      (HRTIM_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_HAL_HRTIM_REGISTER_CALLBACKS == 1)
  hrtim->BurstDMATransferCallback(hrtim, GetTimerIdxFromDMAHandle(hrtim, hdma));
#else
  HAL_HRTIM_BurstDMATransferCallback(hrtim,
                                     GetTimerIdxFromDMAHandle(hrtim, hdma));
#endif /* USE_HAL_HRTIM_REGISTER_CALLBACKS */
}

/**
 * @}
 */

/**
 * @}
 */

#endif /* HRTIM1 */

#endif /* HAL_HRTIM_MODULE_ENABLED */

/**
 * @}
 */
